-- noinspection SqlWithoutWhereForFile

-- noinspection SqlWithoutWhere

DELETE
FROM votes;
DELETE
FROM restaurants;
DELETE
FROM users;
ALTER SEQUENCE GLOBAL_SEQ RESTART WITH 100000;

INSERT INTO users (name, email, password, roles)
VALUES ('Jane Doe', 'janedoe@mail.ru', '{noop}password', 1),
       ('Иван Иванов', 'ivan-i@ya.ru', '{noop}qwerty', 1),
       ('John Doe', 'admin@gmail.com', '{noop}admin', 3);

INSERT INTO restaurants (name)
VALUES ('Prime'),
       ('KFC'),
       ('Му-Му');

INSERT INTO votes (user_id, restaurant_id, date)
VALUES (100000, 100003, '2019-08-01'),
       (100000, 100005, '2019-08-02'),
       (100001, 100003, '2019-08-01'),
       (100001, 100004, '2019-08-02'),
       (100002, 100005, '2019-08-01'),
       (100002, 100004, '2019-08-02');

INSERT INTO courses (name, restaurant_id, date, price)
VALUES ('Салат с тунцом', 100003, '2019-08-01', 25000),
       ('Лапша со свининой', 100003, '2019-08-01', 30000),
       ('Матча латте', 100003, '2019-08-01', 30000),
       ('Салат цезарь', 100003, '2019-08-02', 25000),
       ('Паста с брокколи', 100003, '2019-08-02', 30000),
       ('Раф', 100003, '2019-08-02', 30000),
       ('Тёмный бургер', 100004, '2019-08-01', 19900),
       ('Капучино', 100004, '2019-08-01', 9900),
       ('Твистер острый', 100004, '2019-08-02', 18000),
       ('Чай в ассортименте', 100004, '2019-08-02', 8900),
       ('Капустный салат', 100005, '2019-08-01', 5990),
       ('Борщ', 100005, '2019-08-01', 11990),
       ('Квас', 100005, '2019-08-01', 8990),
       ('Винегрет', 100005, '2019-08-02', 10080),
       ('Домашняя котлета с картофельным пюре', 100005, '2019-08-02', 15150),
       ('Американо со сливками', 100005, '2019-08-02', 12020);