-- noinspection SqlWithoutWhereForFile

-- noinspection SqlWithoutWhere
DELETE FROM offers;
DELETE FROM votes;
DELETE FROM restaurants;
DELETE FROM users;
ALTER SEQUENCE GLOBAL_SEQ RESTART WITH 100000;

INSERT INTO users (name, email, password, roles)
VALUES ('Jane Doe', 'janedoe@mail.ru', '{noop}password', 1),
       ('Иван Иванов', 'ivan-i@ya.ru', '{noop}qwerty', 1),
       ('John Doe', 'admin@gmail.com', '{noop}admin', 3);

INSERT INTO restaurants (name)
VALUES ('Prime'),
       ('KFC'),
       ('Му-Му');

INSERT INTO votes (user_id, restaurant_id, date)
VALUES (100000, 100003, '2019-08-01'),
       (100000, 100005, '2019-08-02'),
       (100001, 100003, '2019-08-01'),
       (100001, 100004, '2019-08-02'),
       (100002, 100005, '2019-08-01'),
       (100002, 100004, '2019-08-02');

INSERT INTO courses (name, restaurant_id)
VALUES ('Салат с тунцом', 100003),
       ('Лапша со свининой', 100003),
       ('Матча латте', 100003),
       ('Салат цезарь', 100003),
       ('Паста с брокколи', 100003),
       ('Раф', 100003),
       ('Тёмный бургер', 100004),
       ('Капучино', 100004),
       ('Твистер острый', 100004),
       ('Чай в ассортименте', 100004),
       ('Капустный салат', 100005),
       ('Борщ', 100005),
       ('Квас', 100005),
       ('Винегрет', 100005),
       ('Домашняя котлета с картофельным пюре', 100005),
       ('Американо со сливками', 100005);

INSERT INTO offers (course_id, restaurant_id, date, price)
VALUES (100012, 100003, '2019-08-01', 25000),
       (100013, 100003, '2019-08-01', 30000),
       (100014, 100003, '2019-08-01', 30000),
       (100015, 100003, '2019-08-02', 25000),
       (100016, 100003, '2019-08-02', 30000),
       (100017, 100003, '2019-08-02', 30000),
       (100018, 100004, '2019-08-01', 19900),
       (100019, 100004, '2019-08-01', 9900),
       (100020, 100004, '2019-08-02', 18000),
       (100021, 100004, '2019-08-02', 8900),
       (100022, 100005, '2019-08-01', 5990),
       (100023, 100005, '2019-08-01', 11990),
       (100024, 100005, '2019-08-01', 8990),
       (100025, 100005, '2019-08-02', 10080),
       (100026, 100005, '2019-08-02', 15150),
       (100027, 100005, '2019-08-02', 12020);